[
  {
    "slug": "hooks-that-work-for-saas-founders",
    "title": "7 LinkedIn Hooks That Actually Work for SaaS Founders",
    "date": "2025-08-16",
    "readTime": 4,
    "tags": [
      "SaaS",
      "Content Strategy",
      "Hooks"
    ],
    "excerpt": "Use these tested openings to stop the scroll and start conversations with buyers and investors.",
    "content": "<p>Strong hooks buy you the next 2 seconds. Here are seven that repeatedly perform for my SaaS clients:</p>    <ol>      <li>“We wasted £12,400 on the wrong ICP. Here’s how we fixed it.”</li>      <li>“The onboarding bug cost us 23% in activations. Postmortem 👇”</li>      <li>“If your demo-to-close is under 15%, try this.”</li>      <li>“3 emails that booked 18 demos last month.”</li>      <li>“Don’t hire a content agency until you read this.”</li>      <li>“What I’d do if I had to get 10 customers in 30 days.”</li>      <li>“We built the wrong feature for 6 months. Lessons.”</li>    </ol>    <p>Pair each hook with a concrete story, a number, and a CTA. Save this and test one this week.</p>"
  },
  {
    "slug": "profile-optimisation-for-leads",
    "title": "Turn Your LinkedIn Profile Into a Lead Funnel",
    "date": "2025-08-16",
    "readTime": 5,
    "tags": [
      "Profile",
      "Positioning",
      "SaaS"
    ],
    "excerpt": "A simple 30-minute makeover that converts views into conversations.",
    "content": "<p>Quick wins:</p>    <ul>      <li>Headline: outcome + audience (e.g., “We get SaaS to 20% MoM with product-led onboarding”).</li>      <li>About: 3-paragraph story → problem, method, proof.</li>      <li>Featured: pin 2–3 posts with lead magnets or case studies.</li>      <li>CTA: calendar link in the first line of About.</li>    </ul>    <p>Do this and you’ll notice higher quality connection requests and more DMs.</p>"
  },
  {
    "slug": "content-calendar-for-solo-founders",
    "title": "A Simple Content Calendar for Busy Solo Founders",
    "date": "2025-08-16",
    "readTime": 3,
    "tags": [
      "Calendar",
      "Consistency",
      "Startups"
    ],
    "excerpt": "Consistency beats perfection. Here’s a 3–post/week system that compounds.",
    "content": "<p>Use this rotation:</p>    <ul>      <li>Mon — Story: a real, raw moment from the build.</li>      <li>Wed — Teach: a tactical tip with screenshots.</li>      <li>Fri — Proof: milestone, customer quote, or mini-case study.</li>    </ul>    <p>Batch write on Sunday. Schedule on Monday. Review on Friday. Simple.</p>"
  }
]